---
kind: property
id: P:Autodesk.Revit.DB.LayoutRuleFixedDistance.JustifyType
source: html/b1d3c09a-967d-c781-3285-4114499df5e1.htm
---
# Autodesk.Revit.DB.LayoutRuleFixedDistance.JustifyType Property

Get or set the type of justification.

## Syntax (C#)
```csharp
public BeamSystemJustifyType JustifyType { get; set; }
```

## Remarks
The justifyType passed in must be a valid object.